# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 156
# 公車需求量 (Covered Demand): 79474.00
# 總需求量 (Total Demand): 106364.00
# 公車需求覆蓋率 (Coverage Rate): 74.72%
# 平均轉乘次數 (Avg Transfers): 0.19
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [3, 8, 13, 19, 18, 22, 21, 26, 20, 25],
    2: [4, 8, 13, 18, 17, 22, 26, 25],
    3: [4, 8, 2, 1, 6, 11, 16, 21, 20, 25],
    4: [10, 15, 11, 17, 16, 21, 26, 25],
}

ds_r = {
    1: 3,
    2: 4,
    3: 4,
    4: 10,
}

ts_r = {
    1: 25,
    2: 25,
    3: 25,
    4: 25,
}
