# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 210
# 公車需求量 (Covered Demand): 105406.00
# 總需求量 (Total Demand): 105406.00
# 公車需求覆蓋率 (Coverage Rate): 100.00%
# 平均轉乘次數 (Avg Transfers): 0.40
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [0, 1, 6, 7, 12, 13, 14, 19, 24, 18, 22, 21, 20, 25],
    2: [0, 5, 10, 15, 16, 17, 18, 23, 22, 21, 26, 27, 28, 29],
    3: [0, 5, 6, 7, 8, 9, 3, 4],
}

ds_r = {
    1: 0,
    2: 0,
    3: 0,
}

ts_r = {
    1: 25,
    2: 29,
    3: 4,
}
