# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 182
# 公車需求量 (Covered Demand): 89996.00
# 總需求量 (Total Demand): 104320.00
# 公車需求覆蓋率 (Coverage Rate): 86.27%
# 平均轉乘次數 (Avg Transfers): 0.36
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [15, 16, 11, 5, 1, 2, 3, 4],
    2: [15, 20, 16, 11, 12, 17, 23, 28],
    3: [15, 10, 5, 11, 17, 23, 19, 24],
    4: [15, 20, 21, 26, 27, 22, 23, 19, 14],
}

ds_r = {
    1: 15,
    2: 15,
    3: 15,
    4: 15,
}

ts_r = {
    1: 4,
    2: 28,
    3: 24,
    4: 14,
}
