# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 132
# 公車需求量 (Covered Demand): 70343.00
# 總需求量 (Total Demand): 108634.00
# 公車需求覆蓋率 (Coverage Rate): 64.75%
# 平均轉乘次數 (Avg Transfers): 0.50
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [3, 8, 9, 17, 23, 18, 19, 24, 29],
    2: [3, 4, 9, 17, 26, 25, 20, 21],
    3: [2, 1, 0, 17, 26, 27],
    4: [15, 20, 21, 26, 27],
}

ds_r = {
    1: 3,
    2: 3,
    3: 2,
    4: 15,
}

ts_r = {
    1: 29,
    2: 21,
    3: 27,
    4: 27,
}
