# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 156
# 公車需求量 (Covered Demand): 76470.00
# 總需求量 (Total Demand): 103541.00
# 公車需求覆蓋率 (Coverage Rate): 73.85%
# 平均轉乘次數 (Avg Transfers): 0.31
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [26, 25, 20, 15, 16, 17, 18, 19, 13, 8, 7, 12, 11, 10, 5, 0],
    2: [0, 1, 2, 6, 7, 8, 9, 4],
    3: [0, 5, 6, 1, 2, 3],
}

ds_r = {
    1: 26,
    2: 0,
    3: 0,
}

ts_r = {
    1: 0,
    2: 4,
    3: 3,
}
