# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 132
# 公車需求量 (Covered Demand): 65922.00
# 總需求量 (Total Demand): 101516.00
# 公車需求覆蓋率 (Coverage Rate): 64.94%
# 平均轉乘次數 (Avg Transfers): 0.58
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [9, 8, 3, 12, 20, 25, 26, 27],
    2: [10, 15, 20, 12, 24, 23, 28],
    3: [1, 0, 12, 3, 4, 9],
    4: [9, 3, 12, 13, 18],
    5: [14, 19, 24, 29, 28],
}

ds_r = {
    1: 9,
    2: 10,
    3: 1,
    4: 9,
    5: 14,
}

ts_r = {
    1: 27,
    2: 28,
    3: 9,
    4: 18,
    5: 28,
}
