# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 156
# 公車需求量 (Covered Demand): 76950.00
# 總需求量 (Total Demand): 101563.00
# 公車需求覆蓋率 (Coverage Rate): 75.77%
# 平均轉乘次數 (Avg Transfers): 0.46
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [0, 5, 1, 2, 3, 8, 13, 14, 9, 4],
    2: [9, 14, 18, 19, 24, 28, 27, 26, 25],
    3: [2, 1, 6, 5, 10, 11, 16, 20, 25],
    4: [0, 1, 6, 7, 8, 4, 3, 2],
}

ds_r = {
    1: 0,
    2: 9,
    3: 2,
    4: 0,
}

ts_r = {
    1: 4,
    2: 25,
    3: 25,
    4: 2,
}
