# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 210
# 公車需求量 (Covered Demand): 103766.00
# 總需求量 (Total Demand): 103766.00
# 公車需求覆蓋率 (Coverage Rate): 100.00%
# 平均轉乘次數 (Avg Transfers): 0.23
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [10, 15, 20, 25, 26, 27, 22, 17, 12, 18, 13, 19, 23, 28, 29],
    2: [11, 6, 5, 0, 1, 2, 7, 13, 18, 23, 24, 19, 14, 9, 4],
}

ds_r = {
    1: 10,
    2: 11,
}

ts_r = {
    1: 29,
    2: 4,
}
