# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 90
# 公車需求量 (Covered Demand): 44114.00
# 總需求量 (Total Demand): 104003.00
# 公車需求覆蓋率 (Coverage Rate): 42.42%
# 平均轉乘次數 (Avg Transfers): 0.64
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [25, 20, 16, 4, 9, 14, 13, 8],
    2: [18, 23, 24, 29, 16, 21, 22, 27],
    3: [6, 1, 0, 16, 20, 15],
    4: [25, 26, 20, 15],
}

ds_r = {
    1: 25,
    2: 18,
    3: 6,
    4: 25,
}

ts_r = {
    1: 8,
    2: 27,
    3: 15,
    4: 15,
}
