# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 72
# 公車需求量 (Covered Demand): 35953.00
# 總需求量 (Total Demand): 106272.00
# 公車需求覆蓋率 (Coverage Rate): 33.83%
# 平均轉乘次數 (Avg Transfers): 0.39
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [9, 8, 13, 12, 25, 26, 21, 27],
    2: [4, 3, 2, 12, 24, 19, 14],
    3: [15, 20, 25, 12, 24, 23, 28],
}

ds_r = {
    1: 9,
    2: 4,
    3: 15,
}

ts_r = {
    1: 27,
    2: 14,
    3: 28,
}
