# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 210
# 公車需求量 (Covered Demand): 107110.00
# 總需求量 (Total Demand): 107110.00
# 公車需求覆蓋率 (Coverage Rate): 100.00%
# 平均轉乘次數 (Avg Transfers): 0.33
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [2, 1, 6, 7, 8, 13, 14, 9],
    2: [0, 1, 6, 11, 17, 12, 7, 2],
    3: [0, 5, 10, 11, 17, 18, 13, 8, 9],
    4: [15, 20, 26, 21, 16, 11, 6, 0],
}

ds_r = {
    1: 2,
    2: 0,
    3: 0,
    4: 15,
}

ts_r = {
    1: 9,
    2: 2,
    3: 9,
    4: 0,
}
