# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 132
# 公車需求量 (Covered Demand): 65925.00
# 總需求量 (Total Demand): 103430.00
# 公車需求覆蓋率 (Coverage Rate): 63.74%
# 平均轉乘次數 (Avg Transfers): 0.23
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [0, 5, 11, 12, 13, 8, 3, 4, 9],
    2: [0, 5, 6, 7, 12, 18, 23, 24, 29],
    3: [3, 2, 8, 7, 12, 13, 14, 9],
    4: [3, 4, 8, 9, 14, 19, 24, 29],
}

ds_r = {
    1: 0,
    2: 0,
    3: 3,
    4: 3,
}

ts_r = {
    1: 9,
    2: 29,
    3: 9,
    4: 29,
}
