# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 156
# 公車需求量 (Covered Demand): 78776.00
# 總需求量 (Total Demand): 107098.00
# 公車需求覆蓋率 (Coverage Rate): 73.56%
# 平均轉乘次數 (Avg Transfers): 0.28
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [4, 9, 8, 12, 17, 22, 27, 28],
    2: [4, 3, 8, 7, 12, 17, 18, 19, 14],
    3: [10, 11, 5, 6, 7, 8, 9, 14],
    4: [4, 3, 7, 6, 12, 13, 14],
}

ds_r = {
    1: 4,
    2: 4,
    3: 10,
    4: 4,
}

ts_r = {
    1: 28,
    2: 14,
    3: 14,
    4: 14,
}
