# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 182
# 公車需求量 (Covered Demand): 92275.00
# 總需求量 (Total Demand): 106468.00
# 公車需求覆蓋率 (Coverage Rate): 86.67%
# 平均轉乘次數 (Avg Transfers): 0.36
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [26, 27, 21, 22, 17, 16, 10, 5, 0],
    2: [0, 5, 6, 10, 15, 20, 21, 25, 26],
    3: [0, 1, 6, 5, 10, 11, 16, 21, 26],
    4: [4, 3, 8, 13, 17, 16, 21, 25],
    5: [0, 1, 2, 7, 12, 13, 8, 9, 4],
}

ds_r = {
    1: 26,
    2: 0,
    3: 0,
    4: 4,
    5: 0,
}

ts_r = {
    1: 0,
    2: 26,
    3: 26,
    4: 25,
    5: 4,
}
