# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 210
# 公車需求量 (Covered Demand): 106296.00
# 總需求量 (Total Demand): 106296.00
# 公車需求覆蓋率 (Coverage Rate): 100.00%
# 平均轉乘次數 (Avg Transfers): 0.42
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [10, 15, 16, 11, 17, 22, 27, 26, 25],
    2: [2, 3, 8, 13, 17, 16, 11, 10],
    3: [2, 1, 6, 11, 12, 17, 16, 15],
    4: [10, 5, 11, 17, 16, 21, 20, 25],
    5: [9, 14, 19, 24, 23, 17, 11, 10],
}

ds_r = {
    1: 10,
    2: 2,
    3: 2,
    4: 10,
    5: 9,
}

ts_r = {
    1: 25,
    2: 10,
    3: 15,
    4: 25,
    5: 10,
}
