# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 90
# 公車需求量 (Covered Demand): 47127.00
# 總需求量 (Total Demand): 107751.00
# 公車需求覆蓋率 (Coverage Rate): 43.74%
# 平均轉乘次數 (Avg Transfers): 0.56
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [15, 20, 25, 26, 12, 0, 1],
    2: [10, 5, 0, 12, 7, 6],
    3: [2, 7, 12, 13, 8],
    4: [14, 9, 4, 12, 26, 27, 22],
}

ds_r = {
    1: 15,
    2: 10,
    3: 2,
    4: 14,
}

ts_r = {
    1: 1,
    2: 6,
    3: 8,
    4: 22,
}
