# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 182
# 公車需求量 (Covered Demand): 92751.00
# 總需求量 (Total Demand): 108540.00
# 公車需求覆蓋率 (Coverage Rate): 85.45%
# 平均轉乘次數 (Avg Transfers): 0.46
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [1, 2, 7, 12, 17, 11, 10, 15, 20, 25],
    2: [0, 5, 6, 11, 16, 15, 20, 21, 22, 28, 27],
    3: [1, 2, 3, 8, 9, 14, 19, 24, 23, 28, 27],
}

ds_r = {
    1: 1,
    2: 0,
    3: 1,
}

ts_r = {
    1: 25,
    2: 27,
    3: 27,
}
