# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 132
# 公車需求量 (Covered Demand): 67379.00
# 總需求量 (Total Demand): 105506.00
# 公車需求覆蓋率 (Coverage Rate): 63.86%
# 平均轉乘次數 (Avg Transfers): 0.36
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [10, 5, 0, 1, 2, 7, 12, 13, 18, 24, 19, 14],
    2: [14, 9, 8, 13, 12, 11, 16, 21, 20, 25],
    3: [4, 3, 8, 13, 19, 14],
}

ds_r = {
    1: 10,
    2: 14,
    3: 4,
}

ts_r = {
    1: 14,
    2: 25,
    3: 14,
}
