# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 156
# 公車需求量 (Covered Demand): 77818.00
# 總需求量 (Total Demand): 100363.00
# 公車需求覆蓋率 (Coverage Rate): 77.54%
# 平均轉乘次數 (Avg Transfers): 0.44
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [5, 10, 11, 12, 7, 8, 4, 3],
    2: [0, 1, 7, 2, 3, 8, 4],
    3: [3, 4, 9, 14, 19, 18, 23, 29, 28],
    4: [0, 1, 6, 7, 8, 9, 4],
}

ds_r = {
    1: 5,
    2: 0,
    3: 3,
    4: 0,
}

ts_r = {
    1: 3,
    2: 4,
    3: 28,
    4: 4,
}
