# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 182
# 公車需求量 (Covered Demand): 91909.00
# 總需求量 (Total Demand): 105821.00
# 公車需求覆蓋率 (Coverage Rate): 86.85%
# 平均轉乘次數 (Avg Transfers): 0.79
# 最大轉乘次數 (Max Transfers): 2
# ==============================

route_nodes = {
    1: [0, 1, 2, 3, 8, 13, 12, 17, 18, 23, 22],
    2: [4, 9, 8, 13, 14, 19, 24, 29],
    3: [5, 10, 11, 12, 16, 21, 26, 25],
}

ds_r = {
    1: 0,
    2: 4,
    3: 5,
}

ts_r = {
    1: 22,
    2: 29,
    3: 25,
}
