# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 182
# 公車需求量 (Covered Demand): 90182.00
# 總需求量 (Total Demand): 102812.00
# 公車需求覆蓋率 (Coverage Rate): 87.72%
# 平均轉乘次數 (Avg Transfers): 0.44
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [5, 0, 1, 2, 6, 7, 12, 11, 17, 22, 21, 20, 25],
    2: [4, 9, 14, 19, 24, 23, 28, 27, 22, 21, 26, 25],
    3: [3, 4, 9, 8, 13, 12, 11, 10, 15],
}

ds_r = {
    1: 5,
    2: 4,
    3: 3,
}

ts_r = {
    1: 25,
    2: 25,
    3: 15,
}
