# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 156
# 公車需求量 (Covered Demand): 81516.00
# 總需求量 (Total Demand): 109256.00
# 公車需求覆蓋率 (Coverage Rate): 74.61%
# 平均轉乘次數 (Avg Transfers): 0.41
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [7, 2, 1, 0, 5, 6, 11, 12, 17, 18, 13, 8, 9, 14, 19],
    2: [26, 25, 20, 15, 16, 21, 22, 17, 23, 24, 29],
    3: [4, 3, 2, 7],
}

ds_r = {
    1: 7,
    2: 26,
    3: 4,
}

ts_r = {
    1: 19,
    2: 29,
    3: 7,
}
