# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 156
# 公車需求量 (Covered Demand): 73999.00
# 總需求量 (Total Demand): 100271.00
# 公車需求覆蓋率 (Coverage Rate): 73.80%
# 平均轉乘次數 (Avg Transfers): 0.51
# 最大轉乘次數 (Max Transfers): 2
# ==============================

route_nodes = {
    1: [10, 5, 0, 1, 2, 7, 6, 11, 12, 17, 22, 21, 20, 25],
    2: [3, 4, 9, 8, 7, 6, 12, 13, 18, 22, 27, 28, 29],
    3: [19, 24, 29],
}

ds_r = {
    1: 10,
    2: 3,
    3: 19,
}

ts_r = {
    1: 25,
    2: 29,
    3: 29,
}
