# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 156
# 公車需求量 (Covered Demand): 82693.00
# 總需求量 (Total Demand): 110076.00
# 公車需求覆蓋率 (Coverage Rate): 75.12%
# 平均轉乘次數 (Avg Transfers): 0.35
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [15, 10, 11, 12, 13, 8, 7, 2, 3, 4],
    2: [0, 5, 6, 11, 16, 20, 21, 26, 25],
    3: [15, 20, 26, 21, 16, 10, 5, 1, 0],
}

ds_r = {
    1: 15,
    2: 0,
    3: 15,
}

ts_r = {
    1: 4,
    2: 25,
    3: 0,
}
