# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 182
# 公車需求量 (Covered Demand): 88522.00
# 總需求量 (Total Demand): 103822.00
# 公車需求覆蓋率 (Coverage Rate): 85.26%
# 平均轉乘次數 (Avg Transfers): 0.36
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [10, 5, 6, 11, 16, 21, 26, 27, 22, 23, 24],
    2: [4, 3, 8, 9, 14, 13, 18, 19, 24, 23, 29],
    3: [24, 29, 23, 18, 17, 16, 21, 20, 15],
}

ds_r = {
    1: 10,
    2: 4,
    3: 24,
}

ts_r = {
    1: 24,
    2: 29,
    3: 15,
}
