# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 110
# 公車需求量 (Covered Demand): 53172.00
# 總需求量 (Total Demand): 100885.00
# 公車需求覆蓋率 (Coverage Rate): 52.71%
# 平均轉乘次數 (Avg Transfers): 0.55
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [28, 29, 24, 12, 25, 26, 27],
    2: [1, 6, 5, 12, 3, 4, 9, 8],
    3: [2, 3, 12, 24, 19, 14],
    4: [15, 20, 25, 12, 3, 8],
}

ds_r = {
    1: 28,
    2: 1,
    3: 2,
    4: 15,
}

ts_r = {
    1: 27,
    2: 8,
    3: 14,
    4: 8,
}
