# ==============================
# 網路績效評估 (Network Metrics)
# 公車起訖對數 (Served OD Pairs): 72
# 公車需求量 (Covered Demand): 37701.00
# 總需求量 (Total Demand): 107644.00
# 公車需求覆蓋率 (Coverage Rate): 35.02%
# 平均轉乘次數 (Avg Transfers): 0.50
# 最大轉乘次數 (Max Transfers): 1
# ==============================

route_nodes = {
    1: [7, 12, 17, 28, 27],
    2: [2, 3, 4, 17, 28, 29, 24, 19],
    3: [1, 6, 5, 17, 25, 20, 15],
    4: [2, 8, 3, 4, 9, 14],
}

ds_r = {
    1: 7,
    2: 2,
    3: 1,
    4: 2,
}

ts_r = {
    1: 27,
    2: 19,
    3: 15,
    4: 14,
}
